CSI API ETABS v1
cPropFrame Interface
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
public interface cPropFrame
Public Interface cPropFrame
Dim instance As cPropFrame
public interface class cPropFrame
type cPropFrame =  interface end
The cPropFrame type exposes the following members.
Properties
Name | Description
SDShape
 Gives access to API calls related to Section Designer sections.
Top
Methods
Name | Description
ChangeName
 Changes the name of an existing frame section property.
Count
 Retrieves the total number of defined frame section properties in the model.
Delete
 Deletes a specified frame section property.
GetAllFrameProperties
 Retrieves select data for all frame properties in the model
GetAllFrameProperties_2
 Retrieves select data for all frame properties in the model, supersedes GetAllFrameProperties(Int32, String[], eFramePropType[], Double[], Double[], Double[], Double[], Double[], Double[])
GetAngle
 Retrieves frame section property data for an angle-type frame section.
GetAngle_1
 Retrieves frame section property data for an angle-type frame section.
GetAutoSelectSteel
 Retrieves frame section property data for a steel auto select lists.
GetChannel
 Retrieves frame section property data for a channel-type frame section.
GetChannel_1
 Retrieves frame section property data for a channel-type frame section.
GetChannel_2
 Retrieves frame section property data for a channel-type frame section.
GetCircle
 Retrieves frame section property data for a circular frame section.
GetColdC
 Retrieves frame section property data for a cold formed C-type frame section.
GetColdC_1
 Retrieves frame section property data for a cold formed C-type frame section.
GetColdHat
 Retrieves frame section property data for a cold formed hat-type frame section.
GetColdHat_1
 Retrieves frame section property data for a cold formed hat-type frame section.
GetColdZ
 Retrieves frame section property data for a cold formed Z-type frame section.
GetColdZ_1
 Retrieves frame section property data for a cold formed Z-type frame section.
GetConcreteBox
 Retrieves frame section property data for a concrete box frame section.
GetConcreteCross
 Retrieves frame section property data for a concrete cross frame section.
GetConcreteL
 Retrieves frame section property data for a concrete L frame section.
GetConcretePipe
 Retrieves frame section property data for a concrete pipe frame section.
GetConcreteTee
 Retrieves frame section property data for a concrete tee frame section.
GetCoverPlatedI
 retrieves frame section property data for a cover plated I-type frame section.
GetDblAngle
 Retrieves frame section property data for a double angle-type frame section.
GetDblAngle_1
 Retrieves frame section property data for a double angle-type frame section.
GetDblAngle_2
 Retrieves frame section property data for a double angle-type frame section.
GetDblChannel
 Retrieves frame section property data for a double channel-type frame section.
GetDblChannel_1
 Retrieves frame section property data for a double channel-type frame section.
GetGeneral
 Retrieves frame section property data for a general frame section
GetGeneral_1
 Retrieves frame section property data for a general frame section
GetISection
 Retrieves frame section property data for an I-type frame section.
GetISection_1
 Retrieves frame section property data for an I-type frame section.
GetMaterial
GetModifiers
 Retrieves the modifier assignments for a frame section property. The default value for all modifiers is one.
GetNameInPropFile
 Retrieves the names of the section property file from which an imported frame section originated, and it also retrieves the section name used in the property file.
GetNameList
 Retrieves the names of all defined frame section properties of the specified type.
GetNonPrismatic
 Assigns data to a nonprismatic frame section property.
GetPipe
 Retrieves frame section property data for a pipe-type frame section.
GetPlate
 Retrieves frame section property data for a plate frame section.
GetPrecastI
 Retrieves frame section property data for a precast concrete I girder frame section.
GetPropFileNameList
 Retrieves the names of all defined frame section properties of a specified type in a specified frame section property file.
GetRebarBeam
 Retrieves beam rebar data for frame sections.
GetRebarColumn
 Retrieves column rebar data for frame sections.
GetRebarColumn_1
GetRectangle
 Retrieves frame section property data for a rectangular frame section.
GetRod
 Retrieves frame section property data for a rod frame section.
GetSDSection
 Retrieves section property data for a section designer section
GetSectProps
GetSteelAngle
 Retrieves frame section property data for a steel angle frame section.
GetSteelTee
 Retrieves frame section property data for a steel tee frame section.
GetTee
 Retrieves frame section property data for a tee-type frame section.
GetTee_1
 Retrieves frame section property data for a tee-type frame section.
GetTrapezoidal
GetTube
 Retrieves frame section property data for a tube-type frame section.
GetTube_1
 Retrieves frame section property data for a tube-type frame section.
GetTypeOAPI
 Retrieves the property type for the specified frame section property.
GetTypeRebar
 Retrieves the rebar design type for the specified frame section property
ImportProp
 Imports a frame section property from a property file.
SetAngle
 Initializes an angle-type frame section property. If this function is called for an existing frame section property, all items for the section are reset to their default value.
SetAngle_1
 Initializes an angle-type frame section property. If this function is called for an existing frame section property, all items for the section are reset to their default value.
SetAutoSelectSteel
 Assigns frame section properties to an auto select list. If this function is called for an existing frame section property, all items for the section are reset to their default value.
SetChannel
 Initializes a channel-type frame section property. If this function is called for an existing frame section property, all items for the section are reset to their default value.
SetChannel_1
 Initializes a channel-type frame section property. If this function is called for an existing frame section property, all items for the section are reset to their default value.
SetChannel_2
 Initializes a channel-type frame section property. If this function is called for an existing frame section property, all items for the section are reset to their default value.
SetCircle
 initializes a solid circular frame section property.If this function is called for an existing frame section property, all items for the section are reset to their default value.
SetColdC
 Initializes a cold formed C-type frame section property. If this function is called for an existing frame section property, all items for the section are reset to their default value.
SetColdC_1
 Initializes a cold formed C-type frame section property. If this function is called for an existing frame section property, all items for the section are reset to their default value.
SetColdHat
 Initializes a cold formed hat-type frame section property. If this function is called for an existing frame section property, all items for the section are reset to their default value.
SetColdHat_1
 Initializes a cold formed hat-type frame section property. If this function is called for an existing frame section property, all items for the section are reset to their default value.
SetColdZ
 Initializes a cold formed Z-type frame section property. If this function is called for an existing frame section property, all items for the section are reset to their default value.
SetColdZ_1
 Initializes a cold formed Z-type frame section property. If this function is called for an existing frame section property, all items for the section are reset to their default value.
SetConcreteBox
 Initializes a concrete box frame section property. If this function is called for an existing frame section property, all items for the section are reset to their default value.
SetConcreteCross
 Initializes a concrete cross frame section property. If this function is called for an existing frame section property, all items for the section are reset to their default value.
SetConcreteL
 Initializes a concrete L frame section property. If this function is called for an existing frame section property, all items for the section are reset to their default value.
SetConcretePipe
 Initializes a concrete pipe frame section property. If this function is called for an existing frame section property, all items for the section are reset to their default value.
SetConcreteTee
 Initializes a concrete tee frame section property. If this function is called for an existing frame section property, all items for the section are reset to their default value.
SetCoverPlatedI
 Initializes a cover plated I-type frame section property. If this function is called for an existing frame section property, all items for the section are reset to their default value.
SetDblAngle
 Initializes a double angle-type frame section property. If this function is called for an existing frame section property, all items for the section are reset to their default value.
SetDblAngle_1
 Initializes a double angle-type frame section property. If this function is called for an existing frame section property, all items for the section are reset to their default value.
SetDblAngle_2
 Initializes a double angle-type frame section property. If this function is called for an existing frame section property, all items for the section are reset to their default value.
SetDblChannel
 Initializes a double channel-type frame section property. If this function is called for an existing frame section property, all items for the section are reset to their default value.
SetDblChannel_1
 Initializes a double channel-type frame section property. If this function is called for an existing frame section property, all items for the section are reset to their default value.
SetGeneral
 Initializes a general frame section property. If this function is called for an existing frame section property, all items for the section are reset to their default value.
SetGeneral_1
 Initializes a general frame section property. If this function is called for an existing frame section property, all items for the section are reset to their default value.
SetISection
 Initializes an I-type frame section property. If this function is called for an existing frame section property, all items for the section are reset to their default value.
SetISection_1
 Initializes an I-type frame section property. If this function is called for an existing frame section property, all items for the section are reset to their default value.
SetMaterial
 Sets the material property of a defined frame section
SetModifiers
 Assigns property modifiers to a frame section property. The default value for all modifiers is one.
SetNonPrismatic
 Assigns data to a nonprismatic frame section property.
SetPipe
 Initializes a pipe-type frame section property. If this function is called for an existing frame section property, all items for the section are reset to their default value.
SetPlate
 Initializes a solid plate frame section property. If this function is called for an existing frame section property, all items for the section are reset to their default value.
SetPrecastI
 Initializes a precast concrete I girder frame section property. If this function is called for an existing frame section property, all items for the section are reset to their default value.
SetRebarBeam
 Assigns beam rebar data to frame sections.
SetRebarColumn
 Assigns column rebar data to frame sections.
SetRectangle
 Initializes a solid rectangular frame section property. If this function is called for an existing frame section property, all items for the section are reset to their default value.
SetRod
 initializes a solid rod frame section property.If this function is called for an existing frame section property, all items for the section are reset to their default value.
SetSDSection
SetSteelAngle
 Initializes a steel angle frame section property. If this function is called for an existing frame section property, all items for the section are reset to their default value.
SetSteelTee
 Initializes a steel tee frame section property. If this function is called for an existing frame section property, all items for the section are reset to their default value.
SetTee
 Initializes a tee-type frame section property. If this function is called for an existing frame section property, all items for the section are reset to their default value.
SetTee_1
 Initializes a tee-type frame section property. If this function is called for an existing frame section property, all items for the section are reset to their default value.
SetTrapezoidal
SetTube
 Initializes a tube-type frame section property. If this function is called for an existing frame section property, all items for the section are reset to their default value.
SetTube_1
 Initializes a tube-type frame section property. If this function is called for an existing frame section property, all items for the section are reset to their default value.
Top
See Also
Reference
ETABSv1 Namespace